conf.org
#+TITLE: Emacs Configuration File v2.0
#+AUTHOR: Maksymilian Rago
#+EMAIL: null
#+DATE: <2016-08-25 Thu>
#+HTML_HEAD: <link rel="stylesheet" href="http://thomasf.github.io/solarized-css/solarized-dark.css" type="text/css" />

* Master List
** User Details
   Emacs will normally pick this up automatically, but this way I can be
   sure the right information is always present.

   #+BEGIN_SRC emacs-lisp
   (setq user-full-name "Maksymilian Rago")
   (setq user-mail-address "")
   #+END_SRC
** Thememing
   Defines a =custom-theme-load-path=. This is useful for thems that
   aren't available within the standard package archives i.e. elpa,
   melpa, or melpa-stable.

   #+BEGIN_SRC emacs-lisp
   (add-to-list 'custom-theme-load-path
   "~/.emacs.d/files/")
   #+END_SRC

   Non-manually entered bit of elisp that is generated by Emacs in order
   to 'tell itself' that it is a safe theme to load. This bit is set to
   be changed in the near future.

   #+BEGIN_SRC emacs-lisp
   (custom-set-variables
   ;; custom-set-variables was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   '(custom-enabled-themes (quote (tty-dark)))
   '(custom-safe-themes (quote ("7b36f45e5f014ac5d463fa1fe627df6f2094484d31c8aecd77d06b0b23844532" default))))
   #+END_SRC
   
   Changes custom font to Unifont Medium, size 12. Only changes the font
   in GUI mode.
   
   #+BEGIN_SRC emacs-lisp
(set-frame-font "Unifont-12" nil t)
   #+END_SRC
** Package Management
   Simply defines a place for Emacs to look for packages. In other words,
   these websites host several different packages that can be downloaded
   and added to Emacs.

   #+BEGIN_SRC emacs-lisp
   (load "package")
   (package-initialize)
   (add-to-list 'package-archives
   '("gnu" . "http://elpa.gnu.org/packages/") t)
   (add-to-list 'package-archives
   '("melpa" . "http://melpa.milkbox.net/packages/") t)
   
   (setq package-archive-enable-alist '(("melpa" deft magit)))
   #+END_SRC
*** Default Packages
    Complicated at first glance, does a rather simple set of
    things. First of which is taking a set of user input 'values.'  These
    'values' are package names that are hosted on the above
    =package-archives=. Additonally, it checks if the package is
    installed, and/or if it requires/has an update.

    #+BEGIN_SRC emacs-lisp
 (require 'package)
 (defvar packages
   '(autopair
     auto-complete
     auto-complete-c-headers
     beacon
     calfw
     dired-filetype-face
     elfeed
     elfeed-org
     engine-mode
     fill-column-indicator
     flycheck
     goto-chg
     highlight-indentation
     highlight-indent-guides
     ido-vertical-mode
     impatient-mode
     ox-twbs
     peep-dired
     smex
     yasnippet)
"a list of packages to ensure are installed at launch.")
    #+END_SRC
*** Install Default Packages
    Downloads listed packages in 'Default Packages'.

    #+BEGIN_SRC emacs-lisp
(require 'cl)
(defun packages-installed-p ()
  (loop for pkg in packages
        when (not (package-installed-p pkg)) do (return nil)
        finally (return t)))

(unless (packages-installed-p)
  (message "%s" "Refreshing package database...")
  (package-refresh-contents)
  (dolist (pkg packages)
    (when (not (package-installed-p pkg))
      (package-install pkg))))
    #+END_SRC
** Start-up Options
*** Splash Screen
    Skips straight to the scratch buffer and eliminates the default Emacs
    startup screen. It also sets the default to =org-mode= rather than
    =fundamental-mode=.

    #+BEGIN_SRC emacs-lisp
(setq inhibit-splash-screen t
      initial-scratch-message nil)
    #+END_SRC
*** Scroll bar, Tool bar, Menu bar
    Disables the menu bar, scroll bar, and tool bar.

    #+BEGIN_SRC emacs-lisp
 (menu-bar-mode -1)
 (scroll-bar-mode -1)
 (tool-bar-mode -1)
    #+END_SRC
*** Display Time
    Displays the current time on the mode line.

    #+BEGIN_SRC emacs-lisp
(display-time-mode t)
    #+END_SRC
*** Highlight Active Line
    =hl-line-mode= highlights the current line and makes keeping track of
    your location much easier.

    #+BEGIN_SRC emacs-lisp
(global-hl-line-mode 1)
(set-face-background hl-line-face "gray13")
    #+END_SRC
