conf.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-10-25 Tue 12:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Configuration File v2.0</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Maksymilian Rago" />
<link rel="stylesheet" href="http://thomasf.github.io/solarized-css/solarized-dark.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs Configuration File v2.0</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline74">1. Master List</a>
<ul>
<li><a href="#orgheadline1">1.1. User Details</a></li>
<li><a href="#orgheadline2">1.2. Thememing</a></li>
<li><a href="#orgheadline5">1.3. Package Management</a>
<ul>
<li><a href="#orgheadline3">1.3.1. Default Packages</a></li>
<li><a href="#orgheadline4">1.3.2. Install Default Packages</a></li>
</ul>
</li>
<li><a href="#orgheadline17">1.4. Start-up Options</a>
<ul>
<li><a href="#orgheadline6">1.4.1. Splash Screen</a></li>
<li><a href="#orgheadline7">1.4.2. Scroll bar, Tool bar, Menu bar</a></li>
<li><a href="#orgheadline8">1.4.3. Display Time</a></li>
<li><a href="#orgheadline9">1.4.4. Highlight Active Line</a></li>
<li><a href="#orgheadline10">1.4.5. Marking/Deleting Text</a></li>
<li><a href="#orgheadline11">1.4.6. Backup Files</a></li>
<li><a href="#orgheadline12">1.4.7. Warning Level</a></li>
<li><a href="#orgheadline13">1.4.8. Yes and No</a></li>
<li><a href="#orgheadline15">1.4.9. Display Settings</a></li>
<li><a href="#orgheadline16">1.4.10. Indentation</a></li>
</ul>
</li>
<li><a href="#orgheadline73">1.5. Utilities</a>
<ul>
<li><a href="#orgheadline19">1.5.1. Smex</a></li>
<li><a href="#orgheadline20">1.5.2. Ido</a></li>
<li><a href="#orgheadline21">1.5.3. Column number mode</a></li>
<li><a href="#orgheadline22">1.5.4. Temporary file prevention/deletion</a></li>
<li><a href="#orgheadline23">1.5.5. auto-fill-mode</a></li>
<li><a href="#orgheadline24">1.5.6. autopair-mode</a></li>
<li><a href="#orgheadline25">1.5.7. show-paren-mode</a></li>
<li><a href="#orgheadline26">1.5.8. auto-complete</a></li>
<li><a href="#orgheadline27">1.5.9. flycheck-mode</a></li>
<li><a href="#orgheadline28">1.5.10. flyspell</a></li>
<li><a href="#orgheadline29">1.5.11. calfw</a></li>
<li><a href="#orgheadline36">1.5.12. Org-mode</a></li>
<li><a href="#orgheadline37">1.5.13. highlight-indentation</a></li>
<li><a href="#orgheadline38">1.5.14. fill-column-indicator</a></li>
<li><a href="#orgheadline39">1.5.15. beacon</a></li>
<li><a href="#orgheadline40">1.5.16. auto-complete-c-headers</a></li>
<li><a href="#orgheadline62">1.5.17. elfeed</a></li>
<li><a href="#orgheadline63">1.5.18. impatient-mode</a></li>
<li><a href="#orgheadline64">1.5.19. yasnippet</a></li>
<li><a href="#orgheadline69">1.5.20. engine-mode</a></li>
<li><a href="#orgheadline70">1.5.21. highlight-indent-guides</a></li>
<li><a href="#orgheadline71">1.5.22. Livestreamer to VLC</a></li>
<li><a href="#orgheadline72">1.5.23. Miscellaneous Export Settings</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline74" class="outline-2">
<h2 id="orgheadline74"><span class="section-number-2">1</span> Master List</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> User Details</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Emacs will normally pick this up automatically, but this way I can be
sure the right information is always present.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq user-full-name <span style="color: #00ff00;">"Maksymilian Rago"</span>)
(setq user-mail-address <span style="color: #00ff00;">""</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Thememing</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Defines a <code>custom-theme-load-path</code>. This is useful for thems that
aren't available within the standard package archives i.e. elpa,
melpa, or melpa-stable.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'custom-theme-load-path
<span style="color: #00ff00;">"~/.emacs.d/files/"</span>)
</pre>
</div>

<p>
Non-manually entered bit of elisp that is generated by Emacs in order
to 'tell itself' that it is a safe theme to load. This bit is set to
be changed in the near future.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(custom-set-variables
<span style="color: #00ffff;">;; </span><span style="color: #00ffff;">custom-set-variables was added by Custom.</span>
<span style="color: #00ffff;">;; </span><span style="color: #00ffff;">If you edit it by hand, you could mess it up, so be careful.</span>
<span style="color: #00ffff;">;; </span><span style="color: #00ffff;">Your init file should contain only one such instance.</span>
<span style="color: #00ffff;">;; </span><span style="color: #00ffff;">If there is more than one, they won't work right.</span>
'(custom-enabled-themes (quote (tty-dark)))
'(custom-safe-themes (quote (<span style="color: #00ff00;">"7b36f45e5f014ac5d463fa1fe627df6f2094484d31c8aecd77d06b0b23844532"</span> default))))
</pre>
</div>

<p>
Changes custom font to Unifont Medium, size 12. Only changes the font
in GUI mode.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(set-frame-font <span style="color: #00ff00;">"Unifont-12"</span> nil t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.3</span> Package Management</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Simply defines a place for Emacs to look for packages. In other words,
these websites host several different packages that can be downloaded
and added to Emacs.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(load <span style="color: #00ff00;">"package"</span>)
(package-initialize)
(add-to-list 'package-archives
'(<span style="color: #00ff00;">"gnu"</span> . <span style="color: #00ff00;">"http://elpa.gnu.org/packages/"</span>) t)
(add-to-list 'package-archives
'(<span style="color: #00ff00;">"melpa"</span> . <span style="color: #00ff00;">"http://melpa.milkbox.net/packages/"</span>) t)

(setq package-archive-enable-alist '((<span style="color: #00ff00;">"melpa"</span> deft magit)))
</pre>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">1.3.1</span> Default Packages</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Complicated at first glance, does a rather simple set of
things. First of which is taking a set of user input 'values.'  These
'values' are package names that are hosted on the above
<code>package-archives</code>. Additonally, it checks if the package is
installed, and/or if it requires/has an update.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"> (<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">package</span>)
 (<span style="color: #ff0000;">defvar</span> <span style="color: #0000ff;">packages</span>
   '(autopair
     auto-complete
     auto-complete-c-headers
     beacon
     calfw
     dired-filetype-face
     elfeed
     elfeed-org
     engine-mode
     fill-column-indicator
     flycheck
     goto-chg
     highlight-indentation
     highlight-indent-guides
     ido-vertical-mode
     impatient-mode
     ox-twbs
     peep-dired
     smex
     yasnippet)
<span style="color: #00ff00;">"a list of packages to ensure are installed at launch."</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">1.3.2</span> Install Default Packages</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Downloads listed packages in 'Default Packages'.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">cl</span>)
(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">packages-installed-p</span> ()
  (<span style="color: #ff0000;">loop</span> for pkg in packages
        when (not (package-installed-p pkg)) do (<span style="color: #ff0000;">return</span> nil)
        finally (<span style="color: #ff0000;">return</span> t)))

(<span style="color: #ff0000;">unless</span> (packages-installed-p)
  (message <span style="color: #00ff00;">"%s"</span> <span style="color: #00ff00;">"Refreshing package database..."</span>)
  (package-refresh-contents)
  (<span style="color: #ff0000;">dolist</span> (pkg packages)
    (<span style="color: #ff0000;">when</span> (not (package-installed-p pkg))
      (package-install pkg))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">1.4</span> Start-up Options</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">1.4.1</span> Splash Screen</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Skips straight to the scratch buffer and eliminates the default Emacs
startup screen. It also sets the default to <code>org-mode</code> rather than
<code>fundamental-mode</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq inhibit-splash-screen t
      initial-scratch-message nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><span class="section-number-4">1.4.2</span> Scroll bar, Tool bar, Menu bar</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
Disables the menu bar, scroll bar, and tool bar.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(menu-bar-mode -1)
(scroll-bar-mode -1)
(tool-bar-mode -1)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><span class="section-number-4">1.4.3</span> Display Time</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
Displays the current time on the mode line.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(display-time-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">1.4.4</span> Highlight Active Line</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
<code>hl-line-mode</code> highlights the current line and makes keeping track of
your location much easier.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-hl-line-mode 1)
(set-face-background hl-line-face <span style="color: #00ff00;">"gray13"</span>)
</pre>
</div>
</div>
</div>
