conf.org
*** Marking/Deleting Text
    The following allows a more standard text editor text deletion method,
    In other words whenever a mark is made and text typed it deletes the
    selected text. The final line allows Emacs to work with the operating
    system clipboard, in other words, the keyring is no longer the only
    way that Emacs grabs copied data.

    #+BEGIN_SRC emacs-lisp
(delete-selection-mode t)
(transient-mark-mode t)
(setq x-select-enable-clipboard t)
    #+END_SRC
*** Backup Files
    File backup files

    #+BEGIN_SRC emacs-lisp
      ;; (setq make-backup-files t
      ;; backup-by-copying t
      ;; version-control t
      ;; auto-save-default t
      ;; auto-save-timeout 20
      ;; auto-save-interval 200
      ;; )

      ;; (setq backup-directory-alist '(("." . "~/ownCloud/Files/Backups")))
      ;; if you change your mind activate the command below to have no backup files
      (setq make-backup-files nil)
    #+END_SRC
*** Warning Level
    Sets the =warning-minimum-level= to emergency levels to prevent
    annoying small errors.

    #+BEGIN_SRC emacs-lisp
    ;;(setq warning-minimum-level :emergency)
    #+END_SRC
*** Yes and No
    Prevents having to type 'yes' or 'no' and instead allows you to type
    'y' or 'n'.

    #+BEGIN_SRC emacs-lisp
    (defalias 'yes-or-no-p 'y-or-n-p)
    #+END_SRC
*** Display Settings
    Puts empty line markers into the left hand side when reaching the
    bottom of a page.

    #+BEGIN_SRC emacs-lisp
(setq-default indicate-empty-lines t)
(when (not indicate-empty-lines)
  (toggle-indicate-empty-lines))
    #+END_SRC
**** Line-number
     Display line number on the right hand side globally.

     #+BEGIN_SRC emacs-lisp
(global-linum-mode t)
     #+END_SRC
*** Indentation
    This re-indents, untabifies, and cleans up whitespace. It is stolen
    directly from the emacs-starter-kit.
    #+BEGIN_SRC emacs-lisp
(defun untabify-buffer ()
  (interactive)
  (untabify (point-min) (point-max)))

(defun indent-buffer ()
  (interactive)
  (indent-region (point-min) (point-max)))

(defun cleanup-buffer ()
  "Perform a bunch of operations on the whitespace content of a
  buffer."
  (interactive)
  (indent-buffer)
  (untabify-buffer)
  (delete-trailing-whitespace))

(defun cleanup-region (beg end)
  "Remove tmux artifacts from region."
  (interactive "r")
  (dolist (re '("\\\\│\·*\n" "\W*│\·*"))
    (replace-regexp re "" nil beg end)))

(global-set-key (kbd "C-x M-t") 'cleanup-region)
(global-set-key (kbd "C-c n") 'cleanup-buffer)

(setq-default show-trailing-whitespace t)
    #+END_SRC
** Utilities
*** Smex
    =smex= provides history and searching on top of =M-x=. Additionally,
    this initlializes =smex= and rebinds it to =M-x=.

    #+BEGIN_SRC emacs-lisp
(require 'smex)

(smex-initialize)

(global-set-key (kbd "M-x") 'smex)
(global-set-key (kbd "M-X") 'smex-major-mode-commands)
    #+END_SRC
**** Restoring old M-x functions
     Adds a "-" after pressing space like regular M-x

     #+BEGIN_SRC emacs-lisp
(defadvice smex (around space-inserts-hyphen activate compile)
        (let ((ido-cannot-complete-command
               `(lambda ()
                  (interactive)
                  (if (string= " " (this-command-keys))
                      (insert ?-)
                    (funcall ,ido-cannot-complete-command)))))
          ad-do-it))
     #+END_SRC

*** Ido
    Ido provides a more aesthetically pleasing way of navigating the
    filesystem.This enables =ido-mode= as well as =ido-vertical-mode=.

    #+BEGIN_SRC emacs-lisp
(require 'ido)
(require 'ido-vertical-mode)

(ido-mode 1)
(ido-vertical-mode 1)
    #+END_SRC
*** Column number mode
    Turns on =column-number-mode= which is listed next to the line number
    in the mini buffer.

    #+BEGIN_SRC emacs-lisp
    (setq column-number-mode t)
    #+END_SRC
*** Temporary file prevention/deletion
    Prevents/deletes temporary files. This makes them go away!

    #+BEGIN_SRC emacs-lisp
    (setq backup-directory-alist `((".*" . ,temporary-file-directory)))
    (setq auto-save-file-name-transforms `((".*" ,temporary-file-directory t)))
    #+END_SRC
*** auto-fill-mode
    Similar to =refill-mode=, but auto wraps text automatically as you
    write.
    
    #+BEGIN_SRC emacs-lisp
    (add-hook 'text-mode-hook 'turn-on-auto-fill)
    #+END_SRC
*** autopair-mode
    This makes sure that =()=, =[]=, ={}=, to be automatically closed as
    soon as they are typed.

    #+BEGIN_SRC emacs-lisp
    (require 'autopair)
    (autopair-global-mode 1)
    #+END_SRC
*** show-paren-mode
    Display corresponding parenthesis.
    #+BEGIN_SRC emacs-lisp
    (show-paren-mode 1)
    #+END_SRC
*** auto-complete
    Turns on auto complete.

    #+BEGIN_SRC emacs-lisp
    (require 'auto-complete)
    (require 'auto-complete-config)
    (ac-config-default)
    (global-auto-complete-mode t)
    #+END_SRC
