conf.html
<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">1.4.5</span> Marking/Deleting Text</h4>
<div class="outline-text-4" id="text-1-4-5">
<p>
The following allows a more standard text editor text deletion method,
In other words whenever a mark is made and text typed it deletes the
selected text. The final line allows Emacs to work with the operating
system clipboard, in other words, the keyring is no longer the only
way that Emacs grabs copied data.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(delete-selection-mode t)
(transient-mark-mode t)
(setq x-select-enable-clipboard t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">1.4.6</span> Backup Files</h4>
<div class="outline-text-4" id="text-1-4-6">
<p>
File backup files
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #00ffff;">;; </span><span style="color: #00ffff;">(setq make-backup-files t</span>
<span style="color: #00ffff;">;; </span><span style="color: #00ffff;">backup-by-copying t</span>
<span style="color: #00ffff;">;; </span><span style="color: #00ffff;">version-control t</span>
<span style="color: #00ffff;">;; </span><span style="color: #00ffff;">auto-save-default t</span>
<span style="color: #00ffff;">;; </span><span style="color: #00ffff;">auto-save-timeout 20</span>
<span style="color: #00ffff;">;; </span><span style="color: #00ffff;">auto-save-interval 200</span>
<span style="color: #00ffff;">;; </span><span style="color: #00ffff;">)</span>

<span style="color: #00ffff;">;; </span><span style="color: #00ffff;">(setq backup-directory-alist '(("." . "~/ownCloud/Files/Backups")))</span>
<span style="color: #00ffff;">;; </span><span style="color: #00ffff;">if you change your mind activate the command below to have no backup files</span>
(setq make-backup-files nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12"><span class="section-number-4">1.4.7</span> Warning Level</h4>
<div class="outline-text-4" id="text-1-4-7">
<p>
Sets the <code>warning-minimum-level</code> to emergency levels to prevent
annoying small errors.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #00ffff;">;;</span><span style="color: #00ffff;">(setq warning-minimum-level :emergency)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13"><span class="section-number-4">1.4.8</span> Yes and No</h4>
<div class="outline-text-4" id="text-1-4-8">
<p>
Prevents having to type 'yes' or 'no' and instead allows you to type
'y' or 'n'.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">defalias</span> '<span style="color: #00ffff;">yes-or-no-p</span> 'y-or-n-p)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-4">
<h4 id="orgheadline15"><span class="section-number-4">1.4.9</span> Display Settings</h4>
<div class="outline-text-4" id="text-1-4-9">
<p>
Puts empty line markers into the left hand side when reaching the
bottom of a page.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq-default indicate-empty-lines t)
(<span style="color: #ff0000;">when</span> (not indicate-empty-lines)
  (toggle-indicate-empty-lines))
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="orgheadline14"></a>Line-number<br  /><div class="outline-text-5" id="text-1-4-9-1">
<p>
Display line number on the right hand side globally.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-linum-mode t)
</pre>
</div>
</div></li></ol>
</div>
<div id="outline-container-orgheadline16" class="outline-4">
<h4 id="orgheadline16"><span class="section-number-4">1.4.10</span> Indentation</h4>
<div class="outline-text-4" id="text-1-4-10">
<p>
This re-indents, untabifies, and cleans up whitespace. It is stolen
directly from the emacs-starter-kit.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">untabify-buffer</span> ()
  (interactive)
  (untabify (point-min) (point-max)))

(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">indent-buffer</span> ()
  (interactive)
  (indent-region (point-min) (point-max)))

(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">cleanup-buffer</span> ()
  <span style="color: #00ff00;">"Perform a bunch of operations on the whitespace content of a</span>
<span style="color: #00ff00;">  buffer."</span>
  (interactive)
  (indent-buffer)
  (untabify-buffer)
  (delete-trailing-whitespace))

(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">cleanup-region</span> (beg end)
  <span style="color: #00ff00;">"Remove tmux artifacts from region."</span>
  (interactive <span style="color: #00ff00;">"r"</span>)
  (<span style="color: #ff0000;">dolist</span> (re '(<span style="color: #00ff00;">"\\\\&#9474;\&#183;*\n"</span> <span style="color: #00ff00;">"\W*&#9474;\&#183;*"</span>))
    (replace-regexp re <span style="color: #00ff00;">""</span> nil beg end)))

(global-set-key (kbd <span style="color: #00ff00;">"C-x M-t"</span>) 'cleanup-region)
(global-set-key (kbd <span style="color: #00ff00;">"C-c n"</span>) 'cleanup-buffer)

(setq-default show-trailing-whitespace t)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline73" class="outline-3">
<h3 id="orgheadline73"><span class="section-number-3">1.5</span> Utilities</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-orgheadline19" class="outline-4">
<h4 id="orgheadline19"><span class="section-number-4">1.5.1</span> Smex</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
<code>smex</code> provides history and searching on top of <code>M-x</code>. Additionally,
this initlializes <code>smex</code> and rebinds it to <code>M-x</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">smex</span>)

(smex-initialize)

(global-set-key (kbd <span style="color: #00ff00;">"M-x"</span>) 'smex)
(global-set-key (kbd <span style="color: #00ff00;">"M-X"</span>) 'smex-major-mode-commands)
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="orgheadline18"></a>Restoring old M-x functions<br  /><div class="outline-text-5" id="text-1-5-1-1">
<p>
Adds a "-" after pressing space like regular M-x
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">defadvice</span> <span style="color: #00ffff;">smex</span> (around space-inserts-hyphen activate compile)
        (<span style="color: #ff0000;">let</span> ((ido-cannot-complete-command
               `(<span style="color: #ff0000;">lambda</span> ()
                  (interactive)
                  (<span style="color: #ff0000;">if</span> (string= <span style="color: #00ff00;">" "</span> (this-command-keys))
                      (insert ?-)
                    (funcall ,ido-cannot-complete-command)))))
          ad-do-it))
</pre>
</div>
</div></li></ol>
</div>

<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20"><span class="section-number-4">1.5.2</span> Ido</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
Ido provides a more aesthetically pleasing way of navigating the
filesystem.This enables <code>ido-mode</code> as well as <code>ido-vertical-mode</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">ido</span>)
(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">ido-vertical-mode</span>)

(ido-mode 1)
(ido-vertical-mode 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21"><span class="section-number-4">1.5.3</span> Column number mode</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
Turns on <code>column-number-mode</code> which is listed next to the line number
in the mini buffer.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq column-number-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22"><span class="section-number-4">1.5.4</span> Temporary file prevention/deletion</h4>
<div class="outline-text-4" id="text-1-5-4">
<p>
Prevents/deletes temporary files. This makes them go away!
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq backup-directory-alist `((<span style="color: #00ff00;">".*"</span> . ,temporary-file-directory)))
(setq auto-save-file-name-transforms `((<span style="color: #00ff00;">".*"</span> ,temporary-file-directory t)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="section-number-4">1.5.5</span> auto-fill-mode</h4>
<div class="outline-text-4" id="text-1-5-5">
<p>
Similar to <code>refill-mode</code>, but auto wraps text automatically as you
write.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'text-mode-hook 'turn-on-auto-fill)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">1.5.6</span> autopair-mode</h4>
<div class="outline-text-4" id="text-1-5-6">
<p>
This makes sure that <code>()</code>, <code>[]</code>, <code>{}</code>, to be automatically closed as
soon as they are typed.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">autopair</span>)
(autopair-global-mode 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25"><span class="section-number-4">1.5.7</span> show-paren-mode</h4>
<div class="outline-text-4" id="text-1-5-7">
<p>
Display corresponding parenthesis.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(show-paren-mode 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">1.5.8</span> auto-complete</h4>
<div class="outline-text-4" id="text-1-5-8">
<p>
Turns on auto complete.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">auto-complete</span>)
(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">auto-complete-config</span>)
(ac-config-default)
(global-auto-complete-mode t)
</pre>
</div>
</div>
</div>
