conf.org
*** flycheck-mode
    =flycheck-mode= is a syntax highlighter for Emacs, and regularly
    checks over code.

    #+BEGIN_SRC emacs-lisp
    (require 'flycheck)
    (global-flycheck-mode)
    #+END_SRC
*** flyspell
    This is the built-in Emacs spell checker.

    #+BEGIN_SRC emacs-lisp
    (setq flyspell-issue-welcome-flag nil)
    (if (eq system-type 'darwin)
    (setq-default ispell-program-name "/usr/local/bin/aspell")
    (setq-default ispell-program-name "/usr/bin/aspell"))
    (setq-default ispell-list-command "list")
    #+END_SRC
*** calfw
    =calfw= is a calander framework for Emacs which displays an ASCII
    calander in an Emacs buffer. It can be matched with org-mode to link
    =TODO= items and more. This changes the start of the week to Sunday
    rather than Monday (0 = Sunday, 1 = Monday).

    #+BEGIN_SRC emacs-lisp
    (require 'calfw)
    (require 'calfw-org)

    (setq calendar-week-start-day 0)

    (global-set-key (kbd "<f12>") 'cfw:open-org-calendar)
    #+END_SRC
*** Org-mode
    Just initialize =org-mode= and different parts of it to make different
    parts of copying source blocks possible. In other words it =init.el=
    or =.emacs= possible to be written in an =.org= file, such as this
    one.

    #+BEGIN_SRC emacs-lisp
    (require 'org-install)
    (require 'ob)
    (require 'ob-tangle)
    #+END_SRC
**** Agenda Directories
     Defines where org-mode should look for agenda files. *Note:* This is
     likely required for calfw integration to properly
     work. *WARNING*: All documents listed as agenda files will be
     synced with =mobile-org-push= and with =calfw=.

     #+BEGIN_SRC emacs-lisp
     (setq org-agenda-files (list "~/Documents/org-files/todo.org"
     "~/Documents/org-files/budget.org"))
     #+END_SRC
**** org-mobile-directory
     Defines the =org-mobile-directory= and pulls/pushes changes.

     #+BEGIN_SRC emacs-lisp
     (setq org-directory "~/Documents/org-files/")
     (setq org-mobile-directory "~/ownCloud/")
     (setq org-mobile-inbox-for-pull "~/Documents/org-files/todo.org")
     #+END_SRC
**** Calander/Diary Integration
     In order to include entries from the Emacs diary into Org mode's
     agenda, you only need to customize the variable. *Note:* Pretty sure
     this is required in order for calfw to be able to read the defined
     agenda directory.

     #+BEGIN_SRC emacs-lisp
     (setq org-agenda-include-diary t)
     #+END_SRC
**** ox-twbs
     Exports =org-mode= docs as HTML compatitible with the Twitter
     Boostrap. It gives =org-mode= docs a simple, clean, and modern look.

     #+BEGIN_SRC emacs-lisp
     (require 'ox-twbs)
     #+END_SRC
**** Additional org-mode-keywords
     This adds additional tags to =org-mode= to increase
     functionality. =nil= don't add anything, just change the
     keyword. =!=, =time= add a time stamp to the task. =@=, =note= prompt for a note
     and ad it with template =org-log-note-headings=.

     #+BEGIN_SRC emacs-lisp
     (setq org-log-done t
     org-todo-keywords '((sequence "TODO(t)" "STARTED(s!)" "WAITING(w)" "QUIZ(q)" "TEST(t)" "PAPER(p)" "HOMEWORK(h)" "|" "DONE(d!)" "CANCELED(c!)")))

     (setq org-todo-keyword-faces
     '(
     ("TODO" . (:foreground "green" :weight bold))
     ("STARTED" . (:foreground "yellow" :weight bold))
     ("WAITING" . (:foreground "gray" :weight bold))
     ("QUIZ" . (:foreground "orange" :weight bold))
     ("TEST" . (:foreground "orange" :weight bold))
     ("PAPER" . (:foreground "orange" :weight bold))
     ("HOMEWORK" . (:foreground "orange" :weight bold))
     ("DONE" . (:foreground "red" :weight bold))
     ("CANCELED" . (:foreground "red" :weight bold))
     ))
     #+END_SRC
**** Archive Keyword Events
     This will archive all specificed files with a certain tag to be put
     into one large file. In this case all =DONE= events will be placed
     into the file location specified.

     #+BEGIN_SRC emacs-lisp
     ;; (defun my-org-archive-done-tasks ()
     ;;   (interactive)
     ;;   (org-map-entries 'org-archive-subtree "/DONE" 'file))
     #+END_SRC
*** highlight-indentation
    Simply highlights the amount of times indentation appears within a
    file.

    #+BEGIN_SRC emacs-lisp
    (require 'highlight-indentation)
    #+END_SRC
*** fill-column-indicator
    This gives a visual marker of where a defined column ends, and where
    text is wrapped.

    #+BEGIN_SRC emacs-lisp
    (require 'fill-column-indicator)
    #+END_SRC
*** beacon
    Produces an animation whenever tabbing between windows or buffers,
    also when scrolling down a page it shows the cursor position.

    #+BEGIN_SRC emacs-lisp
    (require 'beacon)
    (beacon-mode 1)
    #+END_SRC
