conf.html
<div id="outline-container-orgheadline27" class="outline-4">
<h4 id="orgheadline27"><span class="section-number-4">1.5.9</span> flycheck-mode</h4>
<div class="outline-text-4" id="text-1-5-9">
<p>
<code>flycheck-mode</code> is a syntax highlighter for Emacs, and regularly
checks over code.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">flycheck</span>)
(global-flycheck-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline28" class="outline-4">
<h4 id="orgheadline28"><span class="section-number-4">1.5.10</span> flyspell</h4>
<div class="outline-text-4" id="text-1-5-10">
<p>
This is the built-in Emacs spell checker.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq flyspell-issue-welcome-flag nil)
(<span style="color: #ff0000;">if</span> (eq system-type 'darwin)
(setq-default ispell-program-name <span style="color: #00ff00;">"/usr/local/bin/aspell"</span>)
(setq-default ispell-program-name <span style="color: #00ff00;">"/usr/bin/aspell"</span>))
(setq-default ispell-list-command <span style="color: #00ff00;">"list"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline29" class="outline-4">
<h4 id="orgheadline29"><span class="section-number-4">1.5.11</span> calfw</h4>
<div class="outline-text-4" id="text-1-5-11">
<p>
<code>calfw</code> is a calander framework for Emacs which displays an ASCII
calander in an Emacs buffer. It can be matched with org-mode to link
<code>TODO</code> items and more. This changes the start of the week to Sunday
rather than Monday (0 = Sunday, 1 = Monday).
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">calfw</span>)
(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">calfw-org</span>)

(setq calendar-week-start-day 0)

(global-set-key (kbd <span style="color: #00ff00;">"&lt;f12&gt;"</span>) 'cfw:open-org-calendar)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline36" class="outline-4">
<h4 id="orgheadline36"><span class="section-number-4">1.5.12</span> Org-mode</h4>
<div class="outline-text-4" id="text-1-5-12">
<p>
Just initialize <code>org-mode</code> and different parts of it to make different
parts of copying source blocks possible. In other words it <code>init.el</code>
or <code>.emacs</code> possible to be written in an <code>.org</code> file, such as this
one.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">org-install</span>)
(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">ob</span>)
(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">ob-tangle</span>)
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="orgheadline30"></a>Agenda Directories<br  /><div class="outline-text-5" id="text-1-5-12-1">
<p>
Defines where org-mode should look for agenda files. <b>Note:</b> This is
likely required for calfw integration to properly
work. <b>WARNING</b>: All documents listed as agenda files will be
synced with <code>mobile-org-push</code> and with <code>calfw</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-agenda-files (list <span style="color: #00ff00;">"~/Documents/org-files/todo.org"</span>
<span style="color: #00ff00;">"~/Documents/org-files/budget.org"</span>))
</pre>
</div>
</div></li>
<li><a id="orgheadline31"></a>org-mobile-directory<br  /><div class="outline-text-5" id="text-1-5-12-2">
<p>
Defines the <code>org-mobile-directory</code> and pulls/pushes changes.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-directory <span style="color: #00ff00;">"~/Documents/org-files/"</span>)
(setq org-mobile-directory <span style="color: #00ff00;">"~/ownCloud/"</span>)
(setq org-mobile-inbox-for-pull <span style="color: #00ff00;">"~/Documents/org-files/todo.org"</span>)
</pre>
</div>
</div></li>
<li><a id="orgheadline32"></a>Calander/Diary Integration<br  /><div class="outline-text-5" id="text-1-5-12-3">
<p>
In order to include entries from the Emacs diary into Org mode's
agenda, you only need to customize the variable. <b>Note:</b> Pretty sure
this is required in order for calfw to be able to read the defined
agenda directory.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-agenda-include-diary t)
</pre>
</div>
</div></li>
<li><a id="orgheadline33"></a>ox-twbs<br  /><div class="outline-text-5" id="text-1-5-12-4">
<p>
Exports <code>org-mode</code> docs as HTML compatitible with the Twitter
Boostrap. It gives <code>org-mode</code> docs a simple, clean, and modern look.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">ox-twbs</span>)
</pre>
</div>
</div></li>
<li><a id="orgheadline34"></a>Additional org-mode-keywords<br  /><div class="outline-text-5" id="text-1-5-12-5">
<p>
This adds additional tags to <code>org-mode</code> to increase
functionality. <code>nil</code> don't add anything, just change the
keyword. <code>!</code>, <code>time</code> add a time stamp to the task. <code>@</code>, <code>note</code> prompt for a note
and ad it with template <code>org-log-note-headings</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-log-done t
org-todo-keywords '((sequence <span style="color: #00ff00;">"TODO(t)"</span> <span style="color: #00ff00;">"STARTED(s!)"</span> <span style="color: #00ff00;">"WAITING(w)"</span> <span style="color: #00ff00;">"QUIZ(q)"</span> <span style="color: #00ff00;">"TEST(t)"</span> <span style="color: #00ff00;">"PAPER(p)"</span> <span style="color: #00ff00;">"HOMEWORK(h)"</span> <span style="color: #00ff00;">"|"</span> <span style="color: #00ff00;">"DONE(d!)"</span> <span style="color: #00ff00;">"CANCELED(c!)"</span>)))

(setq org-todo-keyword-faces
'(
(<span style="color: #00ff00;">"TODO"</span> . (<span style="color: #0000ff;">:foreground</span> <span style="color: #00ff00;">"green"</span> <span style="color: #0000ff;">:weight</span> bold))
(<span style="color: #00ff00;">"STARTED"</span> . (<span style="color: #0000ff;">:foreground</span> <span style="color: #00ff00;">"yellow"</span> <span style="color: #0000ff;">:weight</span> bold))
(<span style="color: #00ff00;">"WAITING"</span> . (<span style="color: #0000ff;">:foreground</span> <span style="color: #00ff00;">"gray"</span> <span style="color: #0000ff;">:weight</span> bold))
(<span style="color: #00ff00;">"QUIZ"</span> . (<span style="color: #0000ff;">:foreground</span> <span style="color: #00ff00;">"orange"</span> <span style="color: #0000ff;">:weight</span> bold))
(<span style="color: #00ff00;">"TEST"</span> . (<span style="color: #0000ff;">:foreground</span> <span style="color: #00ff00;">"orange"</span> <span style="color: #0000ff;">:weight</span> bold))
(<span style="color: #00ff00;">"PAPER"</span> . (<span style="color: #0000ff;">:foreground</span> <span style="color: #00ff00;">"orange"</span> <span style="color: #0000ff;">:weight</span> bold))
(<span style="color: #00ff00;">"HOMEWORK"</span> . (<span style="color: #0000ff;">:foreground</span> <span style="color: #00ff00;">"orange"</span> <span style="color: #0000ff;">:weight</span> bold))
(<span style="color: #00ff00;">"DONE"</span> . (<span style="color: #0000ff;">:foreground</span> <span style="color: #00ff00;">"red"</span> <span style="color: #0000ff;">:weight</span> bold))
(<span style="color: #00ff00;">"CANCELED"</span> . (<span style="color: #0000ff;">:foreground</span> <span style="color: #00ff00;">"red"</span> <span style="color: #0000ff;">:weight</span> bold))
))
</pre>
</div>
</div></li>
<li><a id="orgheadline35"></a>Archive Keyword Events<br  /><div class="outline-text-5" id="text-1-5-12-6">
<p>
This will archive all specificed files with a certain tag to be put
into one large file. In this case all <code>DONE</code> events will be placed
into the file location specified.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #00ffff;">;; </span><span style="color: #00ffff;">(defun my-org-archive-done-tasks ()</span>
<span style="color: #00ffff;">;;   </span><span style="color: #00ffff;">(interactive)</span>
<span style="color: #00ffff;">;;   </span><span style="color: #00ffff;">(org-map-entries 'org-archive-subtree "/DONE" 'file))</span>
</pre>
</div>
</div></li></ol>
</div>
<div id="outline-container-orgheadline37" class="outline-4">
<h4 id="orgheadline37"><span class="section-number-4">1.5.13</span> highlight-indentation</h4>
<div class="outline-text-4" id="text-1-5-13">
<p>
Simply highlights the amount of times indentation appears within a
file.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">highlight-indentation</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline38" class="outline-4">
<h4 id="orgheadline38"><span class="section-number-4">1.5.14</span> fill-column-indicator</h4>
<div class="outline-text-4" id="text-1-5-14">
<p>
This gives a visual marker of where a defined column ends, and where
text is wrapped.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">fill-column-indicator</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline39" class="outline-4">
<h4 id="orgheadline39"><span class="section-number-4">1.5.15</span> beacon</h4>
<div class="outline-text-4" id="text-1-5-15">
<p>
Produces an animation whenever tabbing between windows or buffers,
also when scrolling down a page it shows the cursor position.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">beacon</span>)
(beacon-mode 1)
</pre>
</div>
</div>
</div>
