conf.org
*** auto-complete-c-headers
    Allows correction and detection of headers in C/C++. The following
    initializes auto-complete-c-headers and defines a directory for where
    they are located. And the last two lines tell Emacs to enable these
    for various modes.

    #+BEGIN_SRC emacs-lisp
    (defun my:ac-c-header-init ()
    (require 'auto-complete-c-headers)
    (add-to-list 'ac-sources 'ac-source-c-headers)
    (add-to-list 'achead:include-directories '" /usr/lib/gcc/x86_64-linux-gnu/4.8/include"))
    
    (add-hook 'c++-mode-hook 'my:ac-c-header-init)
    (add-hook 'c-mode-hook 'my:ac-c-header-init)
    #+END_SRC
*** elfeed
    =elfeed= is a great package that implements a customizible RSS feed
    into Emacs.

    #+BEGIN_SRC emacs-lisp
    (require 'elfeed)
    #+END_SRC
**** Time Format
     This sets the search format for =elfeed= to display as month/day/year
     hour/min/sec AM/PM.

     #+BEGIN_SRC emacs-lisp
     (defun elfeed-search-format-date (date)
     (format-time-string "%m-%d-%Y %I:%M:%S%p" (seconds-to-time date)))
     #+END_SRC
**** Default Search Filter
     Sets the default filter to be anything that has been posted 3 days ago
     and that is unread.

     #+BEGIN_SRC emacs-lisp
     (setq-default elfeed-search-filter "@3-days-ago +unread")
     #+END_SRC
**** elfeed Update Timer
     Makes =elfeed= update every 180 seconds or 3 minutes.

     #+BEGIN_SRC emacs-lisp
     (run-with-timer 0 180 'elfeed-update)
     #+END_SRC
**** RSS Timeout
     If =elfeed= cannot connect to the listed set of RSS sources then it
     will timeout after 10 seconds.

     #+BEGIN_SRC emacs-lisp
     (setf url-queue-timeout 10)
     #+END_SRC
**** elfeed-org
     =elfeed-org= allows listing all rss sources into an org file. The
     second hook initializes elfeed-org.

     #+BEGIN_SRC emacs-lis
     (require 'elfeed-org)
     (elfeed-org)
     #+END_SRC
***** RSS File Directory
      Defines where =elfeed-org= should look for list of RSS sources.

      #+BEGIN_SRC emacs-lisp
      (setq rmh-elfeed-org-files (list "~/.emacs.d/rss_feed.org"))
      #+END_SRC
**** elfeed Tag Bindings
***** All - Recently Updated
      This binds binds "`" (right above Tab) to display all content that was
      posted an hour ago, and is =unread=.

      #+BEGIN_SRC emacs-lisp
 (defun elfeed-default()
   "Shows all content posted an hour ago"
   (interactive)
   (setq elfeed-search-filter "@1-hour-ago +unread")
   (elfeed-search-update :force))
 (define-key elfeed-search-mode-map (kbd "`") 'elfeed-default)
      #+END_SRC
***** YouTube
****** YouTube - Uploaded Today (1 day ago)
       This binds "1" to display all YouTube content that was posted 1 day
       ago, and is =unread=.

       #+BEGIN_SRC emacs-lisp
  (defun elfeed-yt-today()
    "Shows all YouTube videos that were uploaded today."
    (interactive)
    (setq elfeed-search-filter "@1-day-ago +yt +unread")
    (elfeed-search-update :force))
  (define-key elfeed-search-mode-map (kbd "1") 'elfeed-yt-today)
       #+END_SRC
****** YouTube - Uploaded Recently (3 days ago)
       This binds "C-1" to display all YouTube content that was posted 3 days
       ago, and is =unread=.

       #+BEGIN_SRC emacs-lisp
  (defun elfeed-yt-recent ()
    "Shows recently uploaded YouTube videos."
    (interactive)
    (setq elfeed-search-filter "@3-day-ago +yt +unread")
    (elfeed-search-update :force))
  (define-key elfeed-search-mode-map (kbd "C-1") 'elfeed-yt-recent)
       #+END_SRC
****** Youtube - Uploaded Latterly (3 months ago)
       This binds "S-1" to display all YouTube content that was posted 3
       months ago.
       #+BEGIN_SRC emacs-lisp
  (defun elfeed-yt ()
    "Shows uploaded YouTube videos."
    (interactive)
    (setq elfeed-search-filter "@3-months-ago +yt")
    (elfeed-search-update :force))
  (define-key elfeed-search-mode-map (kbd "!") 'elfeed-yt)
       #+END_SRC
***** News
****** stallman.org
******* stallman.org - Posted Today (1 day ago)
        This binds "2" to display all News content that was posted 1 day ago,
        and is =unread=.

        #+BEGIN_SRC emacs-lisp
   (defun elfeed-news-today()
     "Shows recent news articles."
     (interactive)
     (setq elfeed-search-filter "@1-day-ago +news +unread")
     (elfeed-search-update :force))
   (define-key elfeed-search-mode-map (kbd "2") 'elfeed-news-today)
        #+END_SRC
******* stallman.org - Posted Recently (3 days ago)
        This binds "C-2" to display all News content that was posted 3 days ago,
        and is =unread=.

        #+BEGIN_SRC emacs-lisp
   (defun elfeed-news-recent()
     "Shows recent news articles."
     (interactive)
     (setq elfeed-search-filter "@3-days-ago +news +unread")
     (elfeed-search-update :force))
   (define-key elfeed-search-mode-map (kbd "C-2") 'elfeed-news-recent)
        #+END_SRC
******* stallman.org - Posted Latterly (3 months ago)
        This binds "S-2" to display all News content that was posted 3 months
        ago.
        #+BEGIN_SRC emacs-lisp
   (defun elfeed-news()
     "Shows all news articles."
     (interactive)
     (setq elfeed-search-filter "@3-months-ago +news")
     (elfeed-search-update :force))
   (define-key elfeed-search-mode-map (kbd "@") 'elfeed-news)
        #+END_SRC
***** Private
