conf.html
<div id="outline-container-orgheadline40" class="outline-4">
<h4 id="orgheadline40"><span class="section-number-4">1.5.16</span> auto-complete-c-headers</h4>
<div class="outline-text-4" id="text-1-5-16">
<p>
Allows correction and detection of headers in C/C++. The following
initializes auto-complete-c-headers and defines a directory for where
they are located. And the last two lines tell Emacs to enable these
for various modes.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">my:ac-c-header-init</span> ()
(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">auto-complete-c-headers</span>)
(add-to-list 'ac-sources 'ac-source-c-headers)
(add-to-list 'achead:include-directories '<span style="color: #00ff00;">" /usr/lib/gcc/x86_64-linux-gnu/4.8/include"</span>))

(add-hook 'c++-mode-hook 'my:ac-c-header-init)
(add-hook 'c-mode-hook 'my:ac-c-header-init)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline62" class="outline-4">
<h4 id="orgheadline62"><span class="section-number-4">1.5.17</span> elfeed</h4>
<div class="outline-text-4" id="text-1-5-17">
<p>
<code>elfeed</code> is a great package that implements a customizible RSS feed
into Emacs.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">elfeed</span>)
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="orgheadline41"></a>Time Format<br  /><div class="outline-text-5" id="text-1-5-17-1">
<p>
This sets the search format for <code>elfeed</code> to display as month/day/year
hour/min/sec AM/PM.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">elfeed-search-format-date</span> (date)
(format-time-string <span style="color: #00ff00;">"%m-%d-%Y %I:%M:%S%p"</span> (seconds-to-time date)))
</pre>
</div>
</div></li>
<li><a id="orgheadline42"></a>Default Search Filter<br  /><div class="outline-text-5" id="text-1-5-17-2">
<p>
Sets the default filter to be anything that has been posted 3 days ago
and that is unread.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq-default elfeed-search-filter <span style="color: #00ff00;">"@3-days-ago +unread"</span>)
</pre>
</div>
</div></li>
<li><a id="orgheadline43"></a>elfeed Update Timer<br  /><div class="outline-text-5" id="text-1-5-17-3">
<p>
Makes <code>elfeed</code> update every 180 seconds or 3 minutes.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(run-with-timer 0 180 'elfeed-update)
</pre>
</div>
</div></li>
<li><a id="orgheadline44"></a>RSS Timeout<br  /><div class="outline-text-5" id="text-1-5-17-4">
<p>
If <code>elfeed</code> cannot connect to the listed set of RSS sources then it
will timeout after 10 seconds.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setf url-queue-timeout 10)
</pre>
</div>
</div></li>
<li><a id="orgheadline46"></a>elfeed-org<br  /><div class="outline-text-5" id="text-1-5-17-5">
<p>
<code>elfeed-org</code> allows listing all rss sources into an org file. The
second hook initializes elfeed-org.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lis">(require 'elfeed-org)
(elfeed-org)
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="orgheadline45"></a>RSS File Directory<br  /><div class="outline-text-6" id="text-1-5-17-5-1">
<p>
Defines where <code>elfeed-org</code> should look for list of RSS sources.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq rmh-elfeed-org-files (list <span style="color: #00ff00;">"~/.emacs.d/rss_feed.org"</span>))
</pre>
</div>
</div></li></ol></li>
<li><a id="orgheadline61"></a>elfeed Tag Bindings<br  /><ol class="org-ol"><li><a id="orgheadline47"></a>All - Recently Updated<br  /><div class="outline-text-6" id="text-1-5-17-6-1">
<p>
This binds binds "`" (right above Tab) to display all content that was
posted an hour ago, and is <code>unread</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">elfeed-default</span>()
  <span style="color: #00ff00;">"Shows all content posted an hour ago"</span>
  (interactive)
  (setq elfeed-search-filter <span style="color: #00ff00;">"@1-hour-ago +unread"</span>)
  (elfeed-search-update <span style="color: #0000ff;">:force</span>))
(define-key elfeed-search-mode-map (kbd <span style="color: #00ff00;">"`"</span>) 'elfeed-default)
</pre>
</div>
</div></li>
<li><a id="orgheadline51"></a>YouTube<br  /><ol class="org-ol"><li><a id="orgheadline48"></a>YouTube - Uploaded Today (1 day ago)<br  /><div class="outline-text-7" id="text-1-5-17-6-2-1">
<p>
This binds "1" to display all YouTube content that was posted 1 day
ago, and is <code>unread</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">elfeed-yt-today</span>()
  <span style="color: #00ff00;">"Shows all YouTube videos that were uploaded today."</span>
  (interactive)
  (setq elfeed-search-filter <span style="color: #00ff00;">"@1-day-ago +yt +unread"</span>)
  (elfeed-search-update <span style="color: #0000ff;">:force</span>))
(define-key elfeed-search-mode-map (kbd <span style="color: #00ff00;">"1"</span>) 'elfeed-yt-today)
</pre>
</div>
</div></li>
<li><a id="orgheadline49"></a>YouTube - Uploaded Recently (3 days ago)<br  /><div class="outline-text-7" id="text-1-5-17-6-2-2">
<p>
This binds "C-1" to display all YouTube content that was posted 3 days
ago, and is <code>unread</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">elfeed-yt-recent</span> ()
  <span style="color: #00ff00;">"Shows recently uploaded YouTube videos."</span>
  (interactive)
  (setq elfeed-search-filter <span style="color: #00ff00;">"@3-day-ago +yt +unread"</span>)
  (elfeed-search-update <span style="color: #0000ff;">:force</span>))
(define-key elfeed-search-mode-map (kbd <span style="color: #00ff00;">"C-1"</span>) 'elfeed-yt-recent)
</pre>
</div>
</div></li>
<li><a id="orgheadline50"></a>Youtube - Uploaded Latterly (3 months ago)<br  /><div class="outline-text-7" id="text-1-5-17-6-2-3">
<p>
This binds "S-1" to display all YouTube content that was posted 3
months ago.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">elfeed-yt</span> ()
  <span style="color: #00ff00;">"Shows uploaded YouTube videos."</span>
  (interactive)
  (setq elfeed-search-filter <span style="color: #00ff00;">"@3-months-ago +yt"</span>)
  (elfeed-search-update <span style="color: #0000ff;">:force</span>))
(define-key elfeed-search-mode-map (kbd <span style="color: #00ff00;">"!"</span>) 'elfeed-yt)
</pre>
</div>
</div></li></ol></li>
<li><a id="orgheadline56"></a>News<br  /><ol class="org-ol"><li><a id="orgheadline55"></a>stallman.org<br  /><ol class="org-ol"><li><a id="orgheadline52"></a>stallman.org - Posted Today (1 day ago)<br  /><div class="outline-text-8" id="text-1-5-17-6-3-1-1">
<p>
This binds "2" to display all News content that was posted 1 day ago,
and is <code>unread</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">elfeed-news-today</span>()
  <span style="color: #00ff00;">"Shows recent news articles."</span>
  (interactive)
  (setq elfeed-search-filter <span style="color: #00ff00;">"@1-day-ago +news +unread"</span>)
  (elfeed-search-update <span style="color: #0000ff;">:force</span>))
(define-key elfeed-search-mode-map (kbd <span style="color: #00ff00;">"2"</span>) 'elfeed-news-today)
</pre>
</div>
</div></li>
<li><a id="orgheadline53"></a>stallman.org - Posted Recently (3 days ago)<br  /><div class="outline-text-8" id="text-1-5-17-6-3-1-2">
<p>
This binds "C-2" to display all News content that was posted 3 days ago,
and is <code>unread</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">elfeed-news-recent</span>()
  <span style="color: #00ff00;">"Shows recent news articles."</span>
  (interactive)
  (setq elfeed-search-filter <span style="color: #00ff00;">"@3-days-ago +news +unread"</span>)
  (elfeed-search-update <span style="color: #0000ff;">:force</span>))
(define-key elfeed-search-mode-map (kbd <span style="color: #00ff00;">"C-2"</span>) 'elfeed-news-recent)
</pre>
</div>
</div></li>
<li><a id="orgheadline54"></a>stallman.org - Posted Latterly (3 months ago)<br  /><div class="outline-text-8" id="text-1-5-17-6-3-1-3">
<p>
This binds "S-2" to display all News content that was posted 3 months
ago.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">elfeed-news</span>()
  <span style="color: #00ff00;">"Shows all news articles."</span>
  (interactive)
  (setq elfeed-search-filter <span style="color: #00ff00;">"@3-months-ago +news"</span>)
  (elfeed-search-update <span style="color: #0000ff;">:force</span>))
(define-key elfeed-search-mode-map (kbd <span style="color: #00ff00;">"@"</span>) 'elfeed-news)
</pre>
</div>
</div></li></ol></li></ol></li>
