conf.org
****** Private - Posted Today (1 day ago)
       This binds "3" to display all Private content that was posted 1 day ago,
       and is =unread=.

       #+BEGIN_SRC emacs-lisp
  (defun elfeed-p-today()
    "Shows recent lewd content"
    (interactive)
    (setq elfeed-search-filter "@1-day-ago +p +unread")
    (elfeed-search-update :force))
  (define-key elfeed-search-mode-map (kbd "3") 'elfeed-p-today)
       #+END_SRC
****** Private - Posted Recently (3 days ago)
       This binds "C-3" to display all Private content that was posted 3 days ago,
       and is =unread=.

       #+BEGIN_SRC emacs-lisp
  (defun elfeed-p-recent()
    "Shows recent lewd content"
    (interactive)
    (setq elfeed-search-filter "@3-days-ago +p +unread")
    (elfeed-search-update :force))
  (define-key elfeed-search-mode-map (kbd "C-3") 'elfeed-p-recent)
       #+END_SRC
****** Private - Posted Latterly (3 months ago)
       This binds "S-3" to display all Private content that was posted 3
       months ago.

       #+BEGIN_SRC emacs-lisp
  (defun elfeed-p()
    "Shows all lewd content."
    (interactive)
    (setq elfeed-search-filter "@3-months-ago +p")
    (elfeed-search-update :force))
  (define-key elfeed-search-mode-map (kbd "#") 'elfeed-p)
       #+END_SRC
*** impatient-mode
    =impatient-mode= grants Emacs yet another server functionality. In
    this case =impatient-mode= is useful for making websites because it
    gives live updates to the browser of changes. *Note:* In order to
    activate =impatient-mode=, =httpd-start= must be activated, or
    =httpd-stop= to terminate. =impatient-mode= must be enabled within the
    specific buffer as well. To access the buffer in the browser navigate
    to: http://<localhost/device ip>:8080/imp/.

    #+BEGIN_SRC emacs-lisp
(require 'impatient-mode)
    #+END_SRC
*** yasnippet
    Don't really know what this does right now.
    #+BEGIN_SRC emacs-lisp
(require 'yasnippet)
(yas-global-mode 1)
    #+END_SRC
*** engine-mode
    =engine-mode= is a global minor mode for Emacs. It enables you to
    easily define search engines, bind them to keybindings, and query them
    from the comfort of your editor.

    #+BEGIN_SRC emacs-lisp
(require 'engine-mode)
(engine-mode t)
    #+END_SRC
**** Search Engines
     These are the various search engines that can be used by =engine-mode=
     and their respective hotkeys.
***** StartPage
      #+BEGIN_SRC emacs-lisp
 (defengine startpage
   "https://www.startpage.com/do/dsearch?query=%s"
   :keybinding "s")
      #+END_SRC
***** YouTube
      #+BEGIN_SRC emacs-lisp
 (defengine youtube
   "https://www.youtube.com/results?search_query=%s"
   :keybinding "y")
      #+END_SRC
***** DuckDuckGo
      #+BEGIN_SRC emacs-lisp
 (defengine duckduckgo
   "https://duckduckgo.com/?q=%s"
   :keybinding "d")
      #+END_SRC
      # *** External Search Engine Functions
      # **** StartPage Search
      # The following function allows typing a search and having it open
      # externally to the default browser.

      # #+BEGIN_SRC emacs-lisp
      #  (defun startpage-search ()
      #    "Search Startpage with a query or region if any."
      #    (interactive)
      #    (browse-url
      #     (concat
      #      "https://startpage.com/do/search?language=english&cat=web&query="
      #      (url-hexify-string (if mark-active
      #                             (buffer-substring (region-beginning) (region-end))
      #                           (read-string "Search Startpage: "))))))
      # #+END_SRC
      # **** YouTube Search
      # The following function allows typing a search and having it open
      # externally to the default browser.

      # #+BEGIN_SRC emacs-lisp
      #  (defun youtube-search ()
      #    "Search YouTube with a query or region if any."
      #    (interactive)
      #    (browse-url
      #     (concat
      #      "https://www.youtube.com/results?search_query="
      #      (url-hexify-string (if mark-active
      #                             (buffer-substring (region-beginning) (region-end))
      #                           (read-string "Search YouTube: "))))))
      # #+END_SRC
      # **** DuckDuckGo Search
      # The following function allows typing a search and having it open
      # externally to the default browser.

      # #+BEGIN_SRC emacs-lisp
      #  (defun duck-search ()
      #    "Search DuckDuckGo with a query or region if any."
      #    (interactive)
      #    (browse-url
      #     (concat
      #      "https://duckduckgo.com/?q="
      #      (url-hexify-string (if mark-active
      #                             (buffer-substring (region-beginning) (region-end))
      #                           (read-string "Search DuckDuckGo: "))))))
      # #+END_SRC
*** highlight-indent-guides
    Gives a nice line display to show relational brackets.

    #+BEGIN_SRC emacs-lisp
(require 'highlight-indent-guides)
(setq highlight-indent-guides-method 'character)
(add-hook 'prog-mode-hook 'highlight-indent-guides-mode)
    #+END_SRC
