conf.html
<li><a id="orgheadline60"></a>Private<br  /><ol class="org-ol"><li><a id="orgheadline57"></a>Private - Posted Today (1 day ago)<br  /><div class="outline-text-7" id="text-1-5-17-6-4-1">
<p>
This binds "3" to display all Private content that was posted 1 day ago,
and is <code>unread</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">elfeed-p-today</span>()
  <span style="color: #00ff00;">"Shows recent lewd content"</span>
  (interactive)
  (setq elfeed-search-filter <span style="color: #00ff00;">"@1-day-ago +p +unread"</span>)
  (elfeed-search-update <span style="color: #0000ff;">:force</span>))
(define-key elfeed-search-mode-map (kbd <span style="color: #00ff00;">"3"</span>) 'elfeed-p-today)
</pre>
</div>
</div></li>
<li><a id="orgheadline58"></a>Private - Posted Recently (3 days ago)<br  /><div class="outline-text-7" id="text-1-5-17-6-4-2">
<p>
This binds "C-3" to display all Private content that was posted 3 days ago,
and is <code>unread</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">elfeed-p-recent</span>()
  <span style="color: #00ff00;">"Shows recent lewd content"</span>
  (interactive)
  (setq elfeed-search-filter <span style="color: #00ff00;">"@3-days-ago +p +unread"</span>)
  (elfeed-search-update <span style="color: #0000ff;">:force</span>))
(define-key elfeed-search-mode-map (kbd <span style="color: #00ff00;">"C-3"</span>) 'elfeed-p-recent)
</pre>
</div>
</div></li>
<li><a id="orgheadline59"></a>Private - Posted Latterly (3 months ago)<br  /><div class="outline-text-7" id="text-1-5-17-6-4-3">
<p>
This binds "S-3" to display all Private content that was posted 3
months ago.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">elfeed-p</span>()
  <span style="color: #00ff00;">"Shows all lewd content."</span>
  (interactive)
  (setq elfeed-search-filter <span style="color: #00ff00;">"@3-months-ago +p"</span>)
  (elfeed-search-update <span style="color: #0000ff;">:force</span>))
(define-key elfeed-search-mode-map (kbd <span style="color: #00ff00;">"#"</span>) 'elfeed-p)
</pre>
</div>
</div></li></ol></li></ol></li></ol>
</div>
<div id="outline-container-orgheadline63" class="outline-4">
<h4 id="orgheadline63"><span class="section-number-4">1.5.18</span> impatient-mode</h4>
<div class="outline-text-4" id="text-1-5-18">
<p>
<code>impatient-mode</code> grants Emacs yet another server functionality. In
this case <code>impatient-mode</code> is useful for making websites because it
gives live updates to the browser of changes. <b>Note:</b> In order to
activate <code>impatient-mode</code>, <code>httpd-start</code> must be activated, or
<code>httpd-stop</code> to terminate. <code>impatient-mode</code> must be enabled within the
specific buffer as well. To access the buffer in the browser navigate
to: <a href="http:///">http:///</a>&lt;localhost/device ip&gt;:8080/imp/.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">impatient-mode</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline64" class="outline-4">
<h4 id="orgheadline64"><span class="section-number-4">1.5.19</span> yasnippet</h4>
<div class="outline-text-4" id="text-1-5-19">
<p>
Don't really know what this does right now.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">yasnippet</span>)
(yas-global-mode 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline69" class="outline-4">
<h4 id="orgheadline69"><span class="section-number-4">1.5.20</span> engine-mode</h4>
<div class="outline-text-4" id="text-1-5-20">
<p>
<code>engine-mode</code> is a global minor mode for Emacs. It enables you to
easily define search engines, bind them to keybindings, and query them
from the comfort of your editor.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">engine-mode</span>)
(engine-mode t)
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="orgheadline68"></a>Search Engines<br  /><div class="outline-text-5" id="text-1-5-20-1">
<p>
These are the various search engines that can be used by <code>engine-mode</code>
and their respective hotkeys.
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline65"></a>StartPage<br  /><div class="outline-text-6" id="text-1-5-20-1-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defengine startpage
  <span style="color: #00ff00;">"https://www.startpage.com/do/dsearch?query=%s"</span>
  <span style="color: #0000ff;">:keybinding</span> <span style="color: #00ff00;">"s"</span>)
</pre>
</div>
</div></li>
<li><a id="orgheadline66"></a>YouTube<br  /><div class="outline-text-6" id="text-1-5-20-1-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defengine youtube
  <span style="color: #00ff00;">"https://www.youtube.com/results?search_query=%s"</span>
  <span style="color: #0000ff;">:keybinding</span> <span style="color: #00ff00;">"y"</span>)
</pre>
</div>
</div></li>
<li><a id="orgheadline67"></a>DuckDuckGo<br  /><div class="outline-text-6" id="text-1-5-20-1-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defengine duckduckgo
  <span style="color: #00ff00;">"https://duckduckgo.com/?q=%s"</span>
  <span style="color: #0000ff;">:keybinding</span> <span style="color: #00ff00;">"d"</span>)
</pre>
</div>
</div></li></ol></li></ol>
</div>

<div id="outline-container-orgheadline70" class="outline-4">
<h4 id="orgheadline70"><span class="section-number-4">1.5.21</span> highlight-indent-guides</h4>
<div class="outline-text-4" id="text-1-5-21">
<p>
Gives a nice line display to show relational brackets.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">require</span> '<span style="color: #ff00ff;">highlight-indent-guides</span>)
(setq highlight-indent-guides-method 'character)
(add-hook 'prog-mode-hook 'highlight-indent-guides-mode)
</pre>
</div>
</div>
</div>
