conf.org
*** Livestreamer to VLC
    The following function takes a link that is supported by Livestreamer
    (YouTube/Twitch) and pipes it through an emulated terminal. The
    terminal appears as a hidden buffer and kills itself once the
    Livestreamer session is over.

    #+BEGIN_SRC emacs-lisp
(defcustom livestreamer-size "best"
  "The stream size to request from Livestreamer."
  :type 'string)

(defcustom livestreamer-opts nil
  "Additional options to pass to Livestreamer."
  :type 'string)

(defvar-local livestreamer-process nil
  "The Livestreamer process for a `livestreamer-mode' buffer.")

(defvar-local livestreamer-url nil
  "The current stream URL for a `livestreamer-mode' buffer.")

(defvar-local livestreamer-current-size nil
  "The current stream size for a `livestreamer-mode' buffer.")

(defun livestreamer-kill-buffer ()
  "Safely interrupt running stream players under Livestreamer
before killing the buffer."
  (interactive)
  (when (eq major-mode 'livestreamer-mode)
    (if (equal 'run (process-status livestreamer-process))
        (interrupt-process livestreamer-process)
      (kill-buffer))))

(defun livestreamer-reopen-stream ()
  "Re-open the previous stream for this buffer using
Livestreamer."
  (interactive)
  (when (eq major-mode 'livestreamer-mode)
    (let ((inhibit-read-only t))
      (goto-char (point-max))
      (if (equal 'run (process-status livestreamer-process))
          ;; Don't try and re-open if the stream ain't closed!
          (insert (propertize
                   "# Cannot re-open stream: a stream is still open.\n"
                   'face 'font-lock-comment-face))
        (insert (propertize "# Re-opening stream...\n"
                            'face 'font-lock-comment-face))
        (livestreamer-open livestreamer-url nil nil 'no-erase)))))

(defvar livestreamer-mode-map
  (let ((map (make-sparse-keymap)))
    (prog1 map
      (suppress-keymap map)
      (define-key map "q" 'livestreamer-kill-buffer)
      (define-key map "r" 'livestreamer-reopen-stream)
      (define-key map "n" 'next-line)
      (define-key map "p" 'previous-line)))
  "Keymap for `livestreamer-mode'.")

(define-derived-mode livestreamer-mode fundamental-mode "livestreamer"
  "A major mode for Livestreamer output."
  :group 'helm-twitch
  (setq truncate-lines t
        buffer-read-only t)
  (buffer-disable-undo)
  (hl-line-mode))

(defun livestreamer--filter (proc output)
  "Filter OUTPUT from Livestreamer process PROC for display in
the buffer."
  (let ((buff (process-buffer proc)))
    (when (not (null buff))
      (with-current-buffer buff
        (let ((inhibit-read-only t))
          (goto-char (point-max))
          (insert output))))))

(defun livestreamer--sentinel (proc event)
  "Respond when Livestreamer process PROC receives EVENT."
  (let ((buff (process-buffer proc)))
    (when (not (null buff))
      (with-current-buffer buff
        (let ((inhibit-read-only t))
          (goto-char (point-max))
          (if (equal event "finished\n")
      (livestreamer-kill-buffer)
            (insert (propertize (format "# Livestreamer process had event: %s\n"
                                        event)
                                'face 'font-lock-comment-face))))))))

(defun livestreamer-open (url &optional size opts no-erase)
  (interactive "sURL: ")
  "Opens the stream at URL using the Livestreamer program."
  (let* ((cmd  (executable-find "livestreamer"))
         (size (or size livestreamer-size))
         (opts (or opts livestreamer-opts ""))
         (cmd  (when cmd (format "%s %s %s %s" cmd opts url size)))
         (buff (when cmd (get-buffer-create "*livestreamer*"))))
    (if cmd
        (with-current-buffer buff
          (bury-buffer buff)
          (unless (eq major-mode 'livestreamer-mode)
            (livestreamer-mode))
          (let ((inhibit-read-only t))
            (when (not no-erase)
              (erase-buffer)
              (insert (propertize (format "# Livestreamer: %s\n" url)
                                  'face 'font-lock-comment-face)))
            (let ((proc (start-process-shell-command cmd buff cmd)))
              (setq livestreamer-process proc
                    livestreamer-url url
                    livestreamer-current-size size)
          (set-process-filter proc 'livestreamer--filter)
              (set-process-sentinel proc 'livestreamer--sentinel))
          nil))
      (message "Could not locate the livestreamer program."))))
    #+END_SRC
*** Miscellaneous Export Settings
    Removes the validate part from bottom of exported HTML file.

    #+BEGIN_SRC emacs-lisp
      (setq org-html-validation-link nil)
    #+END_SRC
