conf.html
<div id="outline-container-orgheadline71" class="outline-4">
<h4 id="orgheadline71"><span class="section-number-4">1.5.22</span> Livestreamer to VLC</h4>
<div class="outline-text-4" id="text-1-5-22">
<p>
The following function takes a link that is supported by Livestreamer
(YouTube/Twitch) and pipes it through an emulated terminal. The
terminal appears as a hidden buffer and kills itself once the
Livestreamer session is over.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #ff0000;">defcustom</span> <span style="color: #0000ff;">livestreamer-size</span> <span style="color: #00ff00;">"best"</span>
  <span style="color: #00ff00;">"The stream size to request from Livestreamer."</span>
  <span style="color: #0000ff;">:type</span> 'string)

(<span style="color: #ff0000;">defcustom</span> <span style="color: #0000ff;">livestreamer-opts</span> nil
  <span style="color: #00ff00;">"Additional options to pass to Livestreamer."</span>
  <span style="color: #0000ff;">:type</span> 'string)

(defvar-local livestreamer-process nil
  <span style="color: #00ff00;">"The Livestreamer process for a `</span><span style="color: #ff00ff;">livestreamer-mode</span><span style="color: #00ff00;">' buffer."</span>)

(defvar-local livestreamer-url nil
  <span style="color: #00ff00;">"The current stream URL for a `</span><span style="color: #ff00ff;">livestreamer-mode</span><span style="color: #00ff00;">' buffer."</span>)

(defvar-local livestreamer-current-size nil
  <span style="color: #00ff00;">"The current stream size for a `</span><span style="color: #ff00ff;">livestreamer-mode</span><span style="color: #00ff00;">' buffer."</span>)

(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">livestreamer-kill-buffer</span> ()
  <span style="color: #00ff00;">"Safely interrupt running stream players under Livestreamer</span>
<span style="color: #00ff00;">before killing the buffer."</span>
  (interactive)
  (<span style="color: #ff0000;">when</span> (eq major-mode 'livestreamer-mode)
    (<span style="color: #ff0000;">if</span> (equal 'run (process-status livestreamer-process))
        (interrupt-process livestreamer-process)
      (kill-buffer))))

(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">livestreamer-reopen-stream</span> ()
  <span style="color: #00ff00;">"Re-open the previous stream for this buffer using</span>
<span style="color: #00ff00;">Livestreamer."</span>
  (interactive)
  (<span style="color: #ff0000;">when</span> (eq major-mode 'livestreamer-mode)
    (<span style="color: #ff0000;">let</span> ((inhibit-read-only t))
      (goto-char (point-max))
      (<span style="color: #ff0000;">if</span> (equal 'run (process-status livestreamer-process))
          <span style="color: #00ffff;">;; </span><span style="color: #00ffff;">Don't try and re-open if the stream ain't closed!</span>
          (insert (propertize
                   <span style="color: #00ff00;">"# Cannot re-open stream: a stream is still open.\n"</span>
                   'face 'font-lock-comment-face))
        (insert (propertize <span style="color: #00ff00;">"# Re-opening stream...\n"</span>
                            'face 'font-lock-comment-face))
        (livestreamer-open livestreamer-url nil nil 'no-erase)))))

(<span style="color: #ff0000;">defvar</span> <span style="color: #0000ff;">livestreamer-mode-map</span>
  (<span style="color: #ff0000;">let</span> ((map (make-sparse-keymap)))
    (<span style="color: #ff0000;">prog1</span> map
      (suppress-keymap map)
      (define-key map <span style="color: #00ff00;">"q"</span> 'livestreamer-kill-buffer)
      (define-key map <span style="color: #00ff00;">"r"</span> 'livestreamer-reopen-stream)
      (define-key map <span style="color: #00ff00;">"n"</span> 'next-line)
      (define-key map <span style="color: #00ff00;">"p"</span> 'previous-line)))
  <span style="color: #00ff00;">"Keymap for `</span><span style="color: #ff00ff;">livestreamer-mode</span><span style="color: #00ff00;">'."</span>)

(<span style="color: #ff0000;">define-derived-mode</span> <span style="color: #00ffff;">livestreamer-mode</span> fundamental-mode <span style="color: #00ff00;">"livestreamer"</span>
  <span style="color: #00ff00;">"A major mode for Livestreamer output."</span>
  <span style="color: #0000ff;">:group</span> 'helm-twitch
  (setq truncate-lines t
        buffer-read-only t)
  (buffer-disable-undo)
  (hl-line-mode))

(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">livestreamer--filter</span> (proc output)
  <span style="color: #00ff00;">"Filter OUTPUT from Livestreamer process PROC for display in</span>
<span style="color: #00ff00;">the buffer."</span>
  (<span style="color: #ff0000;">let</span> ((buff (process-buffer proc)))
    (<span style="color: #ff0000;">when</span> (not (null buff))
      (<span style="color: #ff0000;">with-current-buffer</span> buff
        (<span style="color: #ff0000;">let</span> ((inhibit-read-only t))
          (goto-char (point-max))
          (insert output))))))

(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">livestreamer--sentinel</span> (proc event)
  <span style="color: #00ff00;">"Respond when Livestreamer process PROC receives EVENT."</span>
  (<span style="color: #ff0000;">let</span> ((buff (process-buffer proc)))
    (<span style="color: #ff0000;">when</span> (not (null buff))
      (<span style="color: #ff0000;">with-current-buffer</span> buff
        (<span style="color: #ff0000;">let</span> ((inhibit-read-only t))
          (goto-char (point-max))
          (<span style="color: #ff0000;">if</span> (equal event <span style="color: #00ff00;">"finished\n"</span>)
      (livestreamer-kill-buffer)
            (insert (propertize (format <span style="color: #00ff00;">"# Livestreamer process had event: %s\n"</span>
                                        event)
                                'face 'font-lock-comment-face))))))))

(<span style="color: #ff0000;">defun</span> <span style="color: #00ffff;">livestreamer-open</span> (url <span style="color: #ffff00;">&amp;optional</span> size opts no-erase)
  (interactive <span style="color: #00ff00;">"sURL: "</span>)
  <span style="color: #00ff00;">"Opens the stream at URL using the Livestreamer program."</span>
  (<span style="color: #ff0000;">let*</span> ((cmd  (executable-find <span style="color: #00ff00;">"livestreamer"</span>))
         (size (or size livestreamer-size))
         (opts (or opts livestreamer-opts <span style="color: #00ff00;">""</span>))
         (cmd  (<span style="color: #ff0000;">when</span> cmd (format <span style="color: #00ff00;">"%s %s %s %s"</span> cmd opts url size)))
         (buff (<span style="color: #ff0000;">when</span> cmd (get-buffer-create <span style="color: #00ff00;">"*livestreamer*"</span>))))
    (<span style="color: #ff0000;">if</span> cmd
        (<span style="color: #ff0000;">with-current-buffer</span> buff
          (bury-buffer buff)
          (<span style="color: #ff0000;">unless</span> (eq major-mode 'livestreamer-mode)
            (livestreamer-mode))
          (<span style="color: #ff0000;">let</span> ((inhibit-read-only t))
            (<span style="color: #ff0000;">when</span> (not no-erase)
              (erase-buffer)
              (insert (propertize (format <span style="color: #00ff00;">"# Livestreamer: %s\n"</span> url)
                                  'face 'font-lock-comment-face)))
            (<span style="color: #ff0000;">let</span> ((proc (start-process-shell-command cmd buff cmd)))
              (setq livestreamer-process proc
                    livestreamer-url url
                    livestreamer-current-size size)
          (set-process-filter proc 'livestreamer--filter)
              (set-process-sentinel proc 'livestreamer--sentinel))
          nil))
      (message <span style="color: #00ff00;">"Could not locate the livestreamer program."</span>))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline72" class="outline-4">
<h4 id="orgheadline72"><span class="section-number-4">1.5.23</span> Miscellaneous Export Settings</h4>
<div class="outline-text-4" id="text-1-5-23">
<p>
Removes the validate part from bottom of exported HTML file.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-html-validation-link nil)
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-08-25 Thu&gt;</span></span></p>
<p class="author">Author: Maksymilian Rago</p>
<p class="date">Created: 2016-10-25 Tue 12:39</p>
<p class="validation"></p>
</div>
</body>
</html>
